Reports/РасчетныеЛисткиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>РасчетныеЛисткиОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпрУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/Работники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Работники</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетнаяПолитикаПоПерсоналу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаПоПерсоналу</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьОтбрасыватьКопейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьВУпрУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьВРеглУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕстьПремии</Name>
					<Comment>Если ИСТИНА, то в табличной части Средней зарплаты появятся строки для расчета премии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕстьГодоваяПремия</Name>
					<Comment>Если ИСТИНА, то в табличной части Средней зарплаты появятся строки для расчета премии за год</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетЗарплатыОрганизацииПоОтветственным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказыватьТабельныеНомераВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСРаботникамиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСРаботникамиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетовУпр</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСуммаНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовСРаботниками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыПоНачислениямЗаСчетФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыПоНачислениямЗаСчетФСС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийРасчетыСФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасчетовСФСС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/РасчетныеЛисткиОрганизаций/Ext/ObjectModule.bsl
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем НП Экспорт;  				  // Настройка периода


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

// Функция формирует основной запрос по сбору данных для расчетных листков.
//
// Параметры
//
// Возвращаемое значение:
//   РезультатЗапроса   – результат запроса.
//
Функция СформироватьЗапрос()

	ОтборРаботника     = (ТипЗнч(СохраненныеНастройки) = Тип("Структура"));
	ОтборОрганизации   = ОтборРаботника;
	ОтборПодразделения = ОтборРаботника;
	
	Если ОтборРаботника Тогда
		
		ОтборОрганизации		  = СохраненныеНастройки.ФлажокНастройкиОрганизация;
		ВидСравненияОрганизации	  = СохраненныеНастройки.ПолеВидаСравненияОрганизация;
		Организация				  = СохраненныеНастройки.ПолеНастройкиОрганизация;
		ОтборПодразделения		  = СохраненныеНастройки.ФлажокНастройкиПодразделение;
		ВидСравненияПодразделения = СохраненныеНастройки.ПолеВидаСравненияПодразделение;
		Подразделение			  = СохраненныеНастройки.ПолеНастройкиПодразделение;
		ОтборРаботника			  = СохраненныеНастройки.ФлажокНастройкиРаботник;
		ВидСравненияРаботника	  = СохраненныеНастройки.ПолеВидаСравненияРаботник;
		Работник				  = СохраненныеНастройки.ПолеНастройкиРаботник;
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода",             ДатаНач);
	Запрос.УстановитьПараметр("НачПериодаСмещенное",    КонецДня(ДатаНач) + 1);
	Запрос.УстановитьПараметр("КонПериода",             КонецДня(ДатаКон));
	
	МассивРасчетов = Новый Массив;
	МассивРасчетов.Добавить(Неопределено);
	МассивРасчетов.Добавить(ПланыВидовРасчета.Начисления.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойВидРасчета",       МассивРасчетов);
	
	Запрос.УстановитьПараметр("СпособРасчетаВзносы", Перечисления.СпособыРасчетаОплатыТруда.Взносы);
	Запрос.УстановитьПараметр("ВидДвиженияРасход",   ВидДвиженияНакопления.Расход );
	
	ВидыВзаиморасчетов = Новый Массив(3);
	ВидыВзаиморасчетов[0] = ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымДивидендам;
	ВидыВзаиморасчетов[1] = ПланыСчетов.Хозрасчетный.ДивидендыПолученные;
	Запрос.УстановитьПараметр("ПарамДивиденды", ВидыВзаиморасчетов);
	
	Запрос.УстановитьПараметр("парамУвольнение",	Перечисления.ПричиныИзмененияСостояния.Увольнение);
	
	КодыОперацииВыплата = Новый СписокЗначений;
	КодыОперацииВыплата.Добавить(Перечисления.КодыОперацийВзаиморасчетыСРаботникамиОрганизаций.Выплата);
	Запрос.УстановитьПараметр("ПарамКодыОперацииВыплата", КодыОперацииВыплата);
	
	ЗапросОтбор = Новый Запрос;
	ЗапросОтбор.УстановитьПараметр("НачПериода",		НачалоДня(ДатаНач));
	ЗапросОтбор.УстановитьПараметр("КонПериода",		КонецДня(ДатаКон));
	ЗапросОтбор.УстановитьПараметр("парамУвольнение",	Перечисления.ПричиныИзмененияСостояния.Увольнение);
	
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();

	Если УпрУчет Тогда
		ТекстЗапросаРаботники = "
		|		ВЫБРАТЬ  
		|			Сотрудники.Организация		КАК Организация,
		|			Сотрудники.Ссылка			КАК Сотрудник,
		|			МАКСИМУМ(Работники.Период)	КАК Период
		|
		|		ИЗ РегистрСведений.Работники КАК Работники 
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК Сотрудники
		|       ПО Работники.ФизЛицо = Сотрудники.ФизЛицо
		|          И Сотрудники.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаПоПерсоналу КАК УчПолитика
		|       ПО Сотрудники.Организация = УчПолитика.Организация
		|          И Сотрудники.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
		|		ГДЕ Работники.Период <= &КонПериода    
		|			И( Работники.ЗанимаемыхСтавок > 0
		|			ИЛИ    Работники.ЗанимаемыхСтавок = 0 И ПричинаИзмененияСостояния = &парамУвольнение)
		|           И УчПолитика.ОтражатьВУпрУчете
		|
		|		СГРУППИРОВАТЬ ПО
		|			Сотрудники.Организация,
		|			Сотрудники.Ссылка
		|";
		
		ТекстЗапросаОтбор = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Работники.Организация	КАК Организация,
		|	Работники.Сотрудник		КАК Сотрудник,
		|	РаботникиПодразделение.Подразделение КАК Подразделение
		|ИЗ ( " + ТекстЗапросаРаботники + "  ) КАК Работники
		| 
		| ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК РаботникиПодразделение
		| ПО	Работники.Сотрудник.ФизЛицо = РаботникиПодразделение.ФизЛицо
		|	И	Работники.Период = РаботникиПодразделение.Период
		|
		|ГДЕ Истина
		|
		|";

	Иначе	
		ТекстЗапросаРаботники = "
		|		ВЫБРАТЬ 
		|			РаботникиОрганизаций.Организация		КАК Организация,
		|			РаботникиОрганизаций.Сотрудник			КАК Сотрудник,
		|			МАКСИМУМ(РаботникиОрганизаций.Период)	КАК Период
		|
		|			ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций 
		|			
		|			ГДЕ РаботникиОрганизаций.Период <= &КонПериода    
		|			И( РаботникиОрганизаций.ЗанимаемыхСтавок > 0
		|			ИЛИ    РаботникиОрганизаций.ЗанимаемыхСтавок = 0 И ПричинаИзмененияСостояния = &парамУвольнение)
		|
		|		СГРУППИРОВАТЬ ПО
		|			РаботникиОрганизаций.Организация,
		|			РаботникиОрганизаций.Сотрудник
		|		
		|		ОБЪЕДИНИТЬ
		|			
		|		ВЫБРАТЬ
		|			ДоговорникиОрганизаций.Организация		КАК Организация,
		|			ДоговорникиОрганизаций.Сотрудник		КАК Сотрудник,
		|			ДоговорникиОрганизаций.ДатаОкончания	КАК Период
		|		ИЗ
		|			Документ.ДоговорНаВыполнениеРаботСФизЛицом	КАК ДоговорникиОрганизаций
		|		ГДЕ
		|			ДоговорникиОрганизаций.ДатаНачала <= &КонПериода
		//:|			И ДоговорникиОрганизаций.ДатаОкончания >= &НачПериода
		|			И ДоговорникиОрганизаций.Проведен
		|
		|";
		
		ТекстЗапросаОтбор = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Работники.Организация	КАК Организация,
		|	Работники.Сотрудник		КАК Сотрудник,
		|	РаботникиПодразделение.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|ИЗ ( " + ТекстЗапросаРаботники + "  ) КАК Работники
		| 
		| ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиПодразделение
		| ПО		Работники.Организация = РаботникиПодразделение.Организация
		|	И	Работники.Сотрудник = РаботникиПодразделение.Сотрудник
		|	И	Работники.Период = РаботникиПодразделение.Период
		|
		|ГДЕ Истина
		|
		|";

	КонецЕсли;	
	
		
	Если ОтборОрганизации Тогда
		
		ЗапросОтбор.УстановитьПараметр("ПарамОрганизация", Организация);
		ВидСравненияОрганизация = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияОрганизации);
		ТекстЗапросаОтбор = ТекстЗапросаОтбор + "
		|		И Работники.Организация " + ВидСравненияОрганизация + " (&ПарамОрганизация)";
		
	КонецЕсли;  
	
	Если НЕ УпрУчет И ОтборПодразделения Тогда
		
		ЗапросОтбор.УстановитьПараметр("ПарамПодразделение", Подразделение);
		ВидСравненияПодразделение = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияПодразделения);
		ТекстЗапросаОтбор = ТекстЗапросаОтбор + "
		|		И РаботникиПодразделение.ПодразделениеОрганизации " + ВидСравненияПодразделение + " (&ПарамПодразделение)";
		
	КонецЕсли;  
	
	Если ОтборРаботника Тогда
		
		ЗапросОтбор.УстановитьПараметр("ПарамСотрудник", Работник);
	    ВидСравненияРаботник = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияРаботника);
		ТекстЗапросаОтбор = ТекстЗапросаОтбор + "
		|		И Работники.Сотрудник " + ВидСравненияРаботник + " (&ПарамСотрудник)";
		
	КонецЕсли;
	
	ЗапросОтбор.Текст = ТекстЗапросаОтбор;
	ТаблицаФизЛиц = ЗапросОтбор.Выполнить().Выгрузить();
	ТаблицаОрганизаций = ТаблицаФизЛиц.Скопировать();
	
	ТаблицаФизЛиц.Свернуть("Сотрудник");
	МассивФизЛиц = ТаблицаФизЛиц.ВыгрузитьКолонку("Сотрудник");
	Запрос.УстановитьПараметр("ПарамСотрудник",	МассивФизЛиц);
	
	Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);
	
	ТаблицаОрганизаций.Свернуть("Организация");
	МассивОрганизаций = ТаблицаОрганизаций.ВыгрузитьКолонку("Организация");
	Запрос.УстановитьПараметр("ПарамОрганизация",	МассивОрганизаций);
	
	
	МенеджерВременныхТаблиц =  Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстЗапросаВТ = "ВЫБРАТЬ
	|	ВзаиморасчетыСРаботниками.Организация КАК Организация,
	|	ВзаиморасчетыСРаботниками.Сотрудник КАК Сотрудник,
	|	ВзаиморасчетыСРаботниками.Период КАК Период
	|   ПОМЕСТИТЬ ВТВзаиморасчетыСРаботниками
	|	ИЗ	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(
	|			                  &НачПериода, &КонПериода, Месяц, , 
	|								Сотрудник в (&ПарамСотрудник)  
	|							И	Организация в (&ПарамОрганизация)
	|							  ) КАК ВзаиморасчетыСРаботниками
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|   Сотрудник,
	|	Период
	|";
	Запрос.Текст = ТекстЗапросаВТ;
	Запрос.Выполнить();
	
	ТекстЗапросаВТ = "ВЫБРАТЬ  
	|	ПлановыеНачисления.Организация КАК Организация,
	|	ПлановыеНачисления.Сотрудник КАК Сотрудник,
	|	ПлановыеНачисления.Регистратор КАК Регистратор,
	|	&НачПериода КАК Период,
	|	ПлановыеНачисления.Показатель1 КАК Размер
	|   ПОМЕСТИТЬ ВТПлановыеНачисленияЗаПериод
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&НачПериода, ВидРасчетаИзмерение.Код ЕСТЬ NULL И Сотрудник в (&ПарамСотрудник) И Организация в (&ПарамОрганизация)) КАК ПлановыеНачисления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПлановыеНачисления.Организация,
	|	ПлановыеНачисления.Сотрудник,
	|	ПлановыеНачисления.Регистратор КАК Регистратор,
	|	ПлановыеНачисления.Период,
	|	ПлановыеНачисления.Показатель1
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисления
	|ГДЕ
	|	ПлановыеНачисления.ВидРасчетаИзмерение.Код ЕСТЬ NULL
	|	И ПлановыеНачисления.Период > &НачПериода
	|	И ПлановыеНачисления.Период <= &КонПериода
	|	И ПлановыеНачисления.Сотрудник в (&ПарамСотрудник)
	|	И ПлановыеНачисления.Организация в (&ПарамОрганизация)
	|   И ПлановыеНачисления.Актуальность
	|";
	Запрос.Текст = ТекстЗапросаВТ;
	Запрос.Выполнить();
	
	Если УпрУчет Тогда
		ТекстЗапросаВТ = "ВЫБРАТЬ
		|	Сотрудники.Организация КАК Организация,
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Работники.Регистратор КАК Регистратор,
		|	&НачПериода КАК Период,
		|	Работники.Подразделение КАК Подразделение,
		|	Работники.Должность КАК Должность
		|ПОМЕСТИТЬ ВТРаботникиОрганизацийЗаПериод
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(&НачПериода, ) КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК Сотрудники
		|		ПО Работники.ФизЛицо = Сотрудники.Физлицо
		|ГДЕ
		|	Сотрудники.Ссылка В(&парамСотрудник)
		|	И Сотрудники.Организация В(&парамОрганизация)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Сотрудники.Организация,
		|	Сотрудники.Ссылка,
		|	Работники.Регистратор,
		|	Работники.Период,
		|	Работники.Подразделение,
		|	Работники.Должность
		|ИЗ
		|	РегистрСведений.Работники КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК Сотрудники
		|		ПО Работники.ФизЛицо = Сотрудники.Физлицо
		|ГДЕ
		|	Сотрудники.Ссылка В(&парамСотрудник)
		|	И Сотрудники.Организация В(&парамОрганизация)
		|	И Работники.Период > &НачПериода
		|	И Работники.Период <= &КонПериода"
		
	Иначе
		
		ТекстЗапросаВТ = "ВЫБРАТЬ
		|	РаботникиОрганизаций.Организация КАК Организация,
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизаций.Регистратор КАК Регистратор,
		|	&НачПериода КАК Период,
		|	РаботникиОрганизаций.ПодразделениеОрганизации,
		|	РаботникиОрганизаций.Должность
		|ПОМЕСТИТЬ ВТРаботникиОрганизацийЗаПериод
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&НачПериода,
		|			ПричинаИзмененияСостояния <> &парамУвольнение
		|				И Сотрудник В (&ПарамСотрудник)
		|				И Организация В (&ПарамОрганизация)) КАК РаботникиОрганизаций
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизаций.Организация,
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.Регистратор,
		|	РаботникиОрганизаций.Период,
		|	РаботникиОрганизаций.ПодразделениеОрганизации,
		|	РаботникиОрганизаций.Должность
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Сотрудник В(&ПарамСотрудник)
		|	И РаботникиОрганизаций.Организация В(&ПарамОрганизация)
		|	И РаботникиОрганизаций.Период > &НачПериода
		|	И РаботникиОрганизаций.Период <= &КонПериода"
	КонецЕсли;
	Запрос.Текст = ТекстЗапросаВТ;
	Запрос.Выполнить();
	
	ТекстЗапросаВТ = "ВЫБРАТЬ
	|	ВзаиморасчетыСРаботниками.Период КАК ПериодРегистрации,
	|	ПлановыеНачисления.Сотрудник КАК Сотрудник,
	|	ПлановыеНачисления.Организация КАК Организация,
	|	ПлановыеНачисления.Размер КАК Размер,
	|	ПлановыеНачисления.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТПлановыеНачисления
	|ИЗ
	|	ВТВзаиморасчетыСРаботниками КАК ВзаиморасчетыСРаботниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВзаиморасчетыСРаботниками.Период КАК ПериодРегистрации,
	|			МАКСИМУМ(ПлановыеНачисления.Период) КАК Период,
	|			ПлановыеНачисления.Организация КАК Организация,
	|			ПлановыеНачисления.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТВзаиморасчетыСРаботниками КАК ВзаиморасчетыСРаботниками
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеНачисленияЗаПериод КАК ПлановыеНачисления
	|				ПО (ПлановыеНачисления.Сотрудник = ВзаиморасчетыСРаботниками.Сотрудник)
	|					И (ПлановыеНачисления.Организация = ВзаиморасчетыСРаботниками.Организация)
	|					И (КОНЕЦПЕРИОДА(ПлановыеНачисления.Период,МЕСЯЦ) <= КОНЕЦПЕРИОДА(ВзаиморасчетыСРаботниками.Период,МЕСЯЦ))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзаиморасчетыСРаботниками.Период,
	|			ПлановыеНачисления.Организация,
	|			ПлановыеНачисления.Сотрудник) КАК СрезыПлановыхНачислений
	|		ПО (СрезыПлановыхНачислений.Сотрудник = ВзаиморасчетыСРаботниками.Сотрудник)
	|			И (СрезыПлановыхНачислений.Организация = ВзаиморасчетыСРаботниками.Организация)
	|			И ВзаиморасчетыСРаботниками.Период = СрезыПлановыхНачислений.ПериодРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеНачисленияЗаПериод КАК ПлановыеНачисления
	|		ПО (ПлановыеНачисления.Сотрудник = ВзаиморасчетыСРаботниками.Сотрудник)
	|			И (ПлановыеНачисления.Организация = ВзаиморасчетыСРаботниками.Организация)
	|			И (ПлановыеНачисления.Период = СрезыПлановыхНачислений.Период)
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодРегистрации,
	|	Организация,
	|   Сотрудник
	|";

	Запрос.Текст = ТекстЗапросаВТ;
	Запрос.Выполнить();

	ТекстЗапросаВТ = "ВЫБРАТЬ
	|	ВзаиморасчетыСРаботниками.Период КАК Период,
	|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизаций.Организация КАК Организация,
	|	РаботникиОрганизаций.Регистратор КАК Регистратор,
	|		"+?(УпрУчет,"РаботникиОрганизаций.Подразделение КАК Подразделение,","РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,")+"

	|	РаботникиОрганизаций.Должность КАК Должность
	|ПОМЕСТИТЬ ВТРаботникиОрганизаций
	|ИЗ
	|	ВТВзаиморасчетыСРаботниками КАК ВзаиморасчетыСРаботниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВзаиморасчетыСРаботниками.Период КАК ПериодРегистрации,
	|			МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	|			РаботникиОрганизаций.Организация КАК Организация,
	|			РаботникиОрганизаций.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТВзаиморасчетыСРаботниками КАК ВзаиморасчетыСРаботниками
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТРаботникиОрганизацийЗаПериод КАК РаботникиОрганизаций
	|				ПО (РаботникиОрганизаций.Сотрудник = ВзаиморасчетыСРаботниками.Сотрудник)
	|					И (РаботникиОрганизаций.Организация = ВзаиморасчетыСРаботниками.Организация)
	|					И (КОНЕЦПЕРИОДА(РаботникиОрганизаций.Период,МЕСЯЦ) <= КОНЕЦПЕРИОДА(ВзаиморасчетыСРаботниками.Период,МЕСЯЦ))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзаиморасчетыСРаботниками.Период,
	|			РаботникиОрганизаций.Организация,
	|			РаботникиОрганизаций.Сотрудник) КАК СрезыРаботникиОрганизаций
	|		ПО (СрезыРаботникиОрганизаций.Сотрудник = ВзаиморасчетыСРаботниками.Сотрудник)
	|			И (СрезыРаботникиОрганизаций.Организация = ВзаиморасчетыСРаботниками.Организация)
	|			И ВзаиморасчетыСРаботниками.Период = СрезыРаботникиОрганизаций.ПериодРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаботникиОрганизацийЗаПериод КАК РаботникиОрганизаций
	|		ПО (РаботникиОрганизаций.Сотрудник = ВзаиморасчетыСРаботниками.Сотрудник)
	|			И (РаботникиОрганизаций.Организация = ВзаиморасчетыСРаботниками.Организация)
	|			И (РаботникиОрганизаций.Период = СрезыРаботникиОрганизаций.Период)
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация,
	|   Сотрудник";

	Запрос.Текст = ТекстЗапросаВТ;
	Запрос.Выполнить();

	
	ТекстНеполаченоФСС = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОтметкаНеоплаченныхНачисленийФССВРасчетныхЛистках");
	
	Если ТекстНеполаченоФСС <> "" Тогда
		ЗапросФСС = Новый Запрос();
		ЗапросФСС.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросФСС.УстановитьПараметр("ПериодРегистрации", 	  	    ДатаНач);
		ЗапросФСС.УстановитьПараметр("КонецПериодаРегистрации", 	КонецДня(ДатаКон));
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| ОсновныеНачисленияРаботниковОрганизации.Регистратор КАК Документ
		|ПОМЕСТИТЬ ВТНачисленияФСС
		|ИЗ
		| РегистрРасчета.Начисления КАК ОсновныеНачисленияРаботниковОрганизации
		|ГДЕ
		| ОсновныеНачисленияРаботниковОрганизации.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
		| И ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.НачислениеЗаСчетФСС
		| И ОсновныеНачисленияРаботниковОрганизации.Результат <> 0
		|";
		ЗапросФСС.Текст = ТекстЗапроса;
		ЗапросФСС.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| ВзаиморасчетыФСС.Документ КАК Документ
		|ПОМЕСТИТЬ ВТПолученоОтФСС
		|ИЗ  РегистрНакопления.ВзаиморасчетыПоНачислениямЗаСчетФСС КАК ВзаиморасчетыФСС
		|ГДЕ
		|	ВзаиморасчетыФСС.Документ.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации 
		|	И ВзаиморасчетыФСС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|";
		ЗапросФСС.Текст = ТекстЗапроса;
		ЗапросФСС.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		| НачисленияФСС.Документ КАК Документ
		|ИЗ  ВТНачисленияФСС КАК НачисленияФСС
		| ЛЕВОЕ СОЕДИНЕНИЕ
		| ВТПолученоОтФСС КАК ПолученоОтФСС
		| ПО НачисленияФСС.Документ = ПолученоОтФСС.Документ
		|ГДЕ
		|	ПолученоОтФСС.Документ ЕСТЬ NULL
		|";
		ЗапросФСС.Текст = ТекстЗапроса;
		НеоплаченоФСС = ЗапросФСС.Выполнить().Выгрузить().ВыгрузитьКолонку("Документ");
		ТекстНеполаченоФСС = " " + ТекстНеполаченоФСС;
	Иначе
		НеоплаченоФСС = Новый Массив();
	КонецЕсли;	
	Запрос.УстановитьПараметр("НеоплаченоФСС",  НеоплаченоФСС);
	Запрос.УстановитьПараметр("ТекстНеполаченоФСС",  ТекстНеполаченоФСС);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА (ФИОФизЛиц.Фамилия) ЕСТЬ NULL  
	|			ТОГДА НачисленияУдержания.Сотрудник.Представление 
	|		ИНАЧЕ ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество 
	|	КОНЕЦ                                              КАК ФИОФизЛицо,
	|	НачисленияУдержания.Сотрудник                      КАК Сотрудник,
	|	НачисленияУдержания.Организация                    КАК Организация,
	|	ВЫРАЗИТЬ(НачисленияУдержания.Организация.НаименованиеПолное
	|	                             КАК СТРОКА(1000))     КАК ОрганизацияНаименованиеПолное,
	|	НачисленияУдержания.ПериодРегистрации              КАК ПериодРегистрации,
	|	НачисленияУдержания.ВидДвижения                    КАК ВидДвижения,
	|	НачисленияУдержания.Регистратор                    КАК Регистратор,
	|	НачисленияУдержания.Порядок                        КАК Порядок,
	|	НачисленияУдержания.Поле1                          КАК Поле1,
	|	НачисленияУдержания.Поле2                          КАК Поле2,
	|	НачисленияУдержания.Поле3                          КАК Поле3,
	|	НачисленияУдержания.Поле4                          КАК Поле4,
	|	НачисленияУдержания.Поле5                          КАК Поле5,
	|	НачисленияУдержания.Поле6                          КАК Поле6,
	|	НачисленияУдержания.КодПоДРФО					   КАК КодПоДРФО 
	|
	|ИЗ  
	|	(ВЫБРАТЬ
	|		""00.ДанныеШапки""                                          КАК ВидДвижения,
	|		РаботникиОрганизаций.Сотрудник                              КАК Сотрудник,
	|		РаботникиОрганизаций.Организация                            КАК Организация,
	|		ВзаиморасчетыСРаботниками.Период     						КАК ПериодРегистрации,
	|		РаботникиОрганизаций.Регистратор                          КАК Регистратор,
	|		РаботникиОрганизаций.Период                               КАК Порядок,
	|		РаботникиОрганизаций.Сотрудник.Код		                КАК Поле1,
	|		ПлановыеНачисления.Регистратор                              КАК Поле2,
	|		NULL                     									КАК Поле3, 
	|		"+?(УпрУчет,"РаботникиОрганизаций.Подразделение","РаботникиОрганизаций.ПодразделениеОрганизации")+" КАК Поле4,
	|		РаботникиОрганизаций.Должность.Представление                КАК Поле5,
	|		ПлановыеНачисления.Размер                                   КАК Поле6,
	|		РаботникиОрганизаций.Сотрудник.ФизЛицо.КодПоДРФО 			КАК КодПоДРФО 
	|       ИЗ ВТВзаиморасчетыСРаботниками КАК ВзаиморасчетыСРаботниками
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеНачисления КАК ПлановыеНачисления
	|			ПО		ВзаиморасчетыСРаботниками.Сотрудник = ПлановыеНачисления.Сотрудник 
	|			И	ВзаиморасчетыСРаботниками.Организация  = ПлановыеНачисления.Организация
	|           И ПлановыеНачисления.ПериодРегистрации = ВзаиморасчетыСРаботниками.Период
	|			
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО		РаботникиОрганизаций.Сотрудник = ВзаиморасчетыСРаботниками.Сотрудник 
	|			И	РаботникиОрганизаций.Организация  = ВзаиморасчетыСРаботниками.Организация
	|           И РаботникиОрганизаций.Период = ВзаиморасчетыСРаботниками.Период

	|	
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР 
	|			КОГДА ОсновныеНачисления.ВидРасчета.СчетУчета В (&ПарамДивиденды)
	|				ТОГДА ""09.ОсновныеНачисленияДивидендов"" 
	|			ИНАЧЕ ""01.ОсновныеНачисления"" 
	|		КОНЕЦ,
	|		ОсновныеНачисления.Сотрудник,
	|		ОсновныеНачисления.Организация,
	|		ОсновныеНачисления.ПериодРегистрации,
	|		ОсновныеНачисления.Регистратор,
	|		ОсновныеНачисления.ВидРасчета.Код,
	|		ВЫБОР КОГДА ОсновныеНачисления.ДокументОснование ССЫЛКА Документ.ЗаменыОрганизаций 
	|				И ОсновныеНачисления.ДокументОснование.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.Замещение)
	|				ТОГДА ""Замена: ""
	|			 КОГДА ОсновныеНачисления.ДокументОснование ССЫЛКА Документ.ЗаменыОрганизаций 
	|				И ОсновныеНачисления.ДокументОснование.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.Совмещение)
	|				ТОГДА ""Совмещение: ""
	|				ИНАЧЕ """"
	|		КОНЕЦ
	|		 + ОсновныеНачисления.ВидРасчета.Наименование + ВЫБОР
	|			КОГДА ЕСТЬNULL(ОсновныеНачисления.Сотрудник.ВидЗанятости, Значение(Перечисление.ВидыЗанятостиВОрганизации.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|				ТОГДА """"
	|			ИНАЧЕ "" (по внутр. совмест-ву)""
	|		КОНЕЦ
	|		 + ВЫБОР
	|			КОГДА ОсновныеНачисления.ВидРасчета.НачислениеЗаСчетФСС И ОсновныеНачисления.Регистратор В (&НеоплаченоФСС)
	|				ТОГДА &ТекстНеполаченоФСС
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК ВидРасчета,
	//|		ОсновныеНачисления.БазовыйПериодНачало,
	//|		КОНЕЦПЕРИОДА(ОсновныеНачисления.БазовыйПериодНачало, МЕСЯЦ),
	|		ОсновныеНачисления.ПериодДействияНачало,
	|		ОсновныеНачисления.ПериодДействияКонец,
	|		"+?(УпрУчет,"ОсновныеНачисления.РезультатУпр","ОсновныеНачисления.Результат")+",
	|		ВЫБОР
	|				КОГДА ОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
	|					ТОГДА ОсновныеНачисления.ОтработаноДней
	|				КОГДА ОсновныеНачисления.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимДням)
	|					ИЛИ ОсновныеНачисления.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоКалендарнымДням)
	|					ТОГДА ОсновныеНачисления.ОплаченоДнейЧасов
	|				КОГДА ОсновныеНачисления.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимЧасам)
	|					ТОГДА 0
	|				КОГДА ОсновныеНачисления.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|					ТОГДА ОсновныеНачисления.ОплаченоДнейЧасов
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОтработаноДней, 
	|		ВЫБОР
	|				КОГДА ОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
	|					ТОГДА ОсновныеНачисления.ОтработаноЧасов
	|				КОГДА ОсновныеНачисления.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимДням)
	|					ИЛИ ОсновныеНачисления.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоКалендарнымДням)
	|					ТОГДА 0
	|				КОГДА ОсновныеНачисления.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоРабочимЧасам)
	|					ТОГДА ОсновныеНачисления.ОплаченоДнейЧасов
	|				КОГДА ОсновныеНачисления.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|					ИЛИ ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаВечерниеЧасы)
	|					ИЛИ ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы)
	|					ТОГДА ОсновныеНачисления.ОплаченоДнейЧасов
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОтработаноЧасов, 
	|           NULL 
	|	ИЗ
	|		РегистрРасчета.Начисления КАК ОсновныеНачисления
	|	
	|	ГДЕ
	|		ОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачПериода И &КонПериода
	|	    И "+?(УпрУчет,"ОсновныеНачисления.РезультатУпр","ОсновныеНачисления.Результат")+" <> 0                                                                       
	|		И ОсновныеНачисления.Сотрудник в (&ПарамСотрудник)  
	|		И ОсновныеНачисления.Организация в (&ПарамОрганизация)
	|	                                                                           
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			""03.Удержания"" КАК ВидДвижения,
	|			УдержанияРаботниковОрганизаций.Сотрудник,
	|			УдержанияРаботниковОрганизаций.Организация,
	|			УдержанияРаботниковОрганизаций.ПериодРегистрации,
	|			УдержанияРаботниковОрганизаций.Регистратор,
	|			УдержанияРаботниковОрганизаций.ВидРасчета.Код,
	|			УдержанияРаботниковОрганизаций.ВидРасчета.Наименование,
	|			УдержанияРаботниковОрганизаций.БазовыйПериодНачало,
	|			КОНЕЦПЕРИОДА(УдержанияРаботниковОрганизаций.БазовыйПериодНачало,МЕСЯЦ),
	|			"+?(УпрУчет,"УдержанияРаботниковОрганизаций.РезультатУпр","УдержанияРаботниковОрганизаций.Результат")+",
	|			NULL,
	|			NULL,
	|			NULL 
	|		ИЗ
	|			РегистрРасчета.Удержания КАК УдержанияРаботниковОрганизаций
	|		
	|		ГДЕ 	УдержанияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачПериода И &КонПериода
	|			И	УдержанияРаботниковОрганизаций.Сотрудник в (&ПарамСотрудник)  
	|			И	УдержанияРаботниковОрганизаций.Организация в (&ПарамОрганизация)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			""04.НДФЛ"" КАК ВидДвижения,
	|			ВзаиморасчетыПоНДФЛ.Сотрудник,
	|			ВзаиморасчетыПоНДФЛ.Организация,
	|			НАЧАЛОПЕРИОДА(ВзаиморасчетыПоНДФЛ.Период, МЕСЯЦ),
	|			ВзаиморасчетыПоНДФЛ.Регистратор,
	|			ВзаиморасчетыПоНДФЛ.Период,
	//ВОЕННЫЙ СБОР
	|		ВЫБОР 
	|		 КОГДА ВзаиморасчетыПоНДФЛ.ДоходНДФЛ.ВидставкиВоенныйСбор = ВзаиморасчетыПоНДФЛ.ДоходНДФЛ.ВидСтавкиРезидента
	|		 ТОГДА """+НСтр("ru='Военный сбор';uk='Військовий збір'", КодЯзыкаПечать)+"""
	|		 ИНАЧЕ """+НСтр("ru='НДФЛ';uk='ПДФО'", КодЯзыкаПечать)+"""
	|       КОНЕЦ,
	|			ВзаиморасчетыПоНДФЛ.Период,
	|			КОНЕЦПЕРИОДА(ВзаиморасчетыПоНДФЛ.Период, МЕСЯЦ),
	|			СУММА("+?(УпрУчет,"ВзаиморасчетыПоНДФЛ.НалогУпрПриход","ВзаиморасчетыПоНДФЛ.НалогПриход")+"),
	|			NULL,
	|			NULL,
	|			NULL 
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыПоНДФЛ.Обороты(&НачПериода, &КонПериода, Регистратор,
	|								Сотрудник в (&ПарамСотрудник)  
	|							И	Организация в (&ПарамОрганизация)
	|			     			  ) КАК ВзаиморасчетыПоНДФЛ
	|		ГДЕ ВзаиморасчетыПоНДФЛ.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций
	|		
	|		СГРУППИРОВАТЬ ПО
	|			""04.НДФЛ"",
	|			ВзаиморасчетыПоНДФЛ.Сотрудник,
	//ВОЕННЫЙ СБОР
	|		ВЫБОР 
	|		 КОГДА ВзаиморасчетыПоНДФЛ.ДоходНДФЛ.ВидставкиВоенныйСбор = ВзаиморасчетыПоНДФЛ.ДоходНДФЛ.ВидСтавкиРезидента
	|		 ТОГДА """+НСтр("ru='Военный сбор';uk='Військовий збір'", КодЯзыкаПечать)+"""
	|		 ИНАЧЕ """+НСтр("ru='НДФЛ';uk='ПДФО'", КодЯзыкаПечать)+"""
	|       КОНЕЦ,
	|			ВзаиморасчетыПоНДФЛ.Организация,
	|			НАЧАЛОПЕРИОДА(ВзаиморасчетыПоНДФЛ.Период, МЕСЯЦ),
	|			ВзаиморасчетыПоНДФЛ.Регистратор,
	|			ВзаиморасчетыПоНДФЛ.Период
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			""05.ВзносыВФонды"" КАК ВидДвижения,
	|			ВзносыВФонды.Сотрудник,
	|			ВзносыВФонды.Организация,
	|			НАЧАЛОПЕРИОДА(ВзносыВФонды.Период,МЕСЯЦ),
	|			NULL,
	|			ВзносыВФонды.СтатьяНалоговойДекларации.Код,
	|			ВзносыВФонды.СтатьяНалоговойДекларации.Наименование,
	|			НАЧАЛОПЕРИОДА(ВзносыВФонды.ПериодВзаиморасчетов, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(ВзносыВФонды.ПериодВзаиморасчетов, МЕСЯЦ),
	|			СУММА(ВзносыВФонды.Результат),
	|			NULL,
	|			NULL,
	|			NULL 
	|		
	|		ИЗ	РегистрНакопления.ВзаиморасчетыПоВзносамВФонды КАК ВзносыВФонды
	|		
	|		ГДЕ ВзносыВФонды.Результат <> 0 И
	|			ВзносыВФонды.Период МЕЖДУ &НачПериода И &КонПериода
	|		  И
	|			ВзносыВФонды.ВидДвижения 		=	&Приход
	|		  И 
	|			ВзносыВФонды.Налог.Родитель = ЗНАЧЕНИЕ(Справочник.Налоги.Взносы)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			""05.ВзносыВФонды"",
	|			ВзносыВФонды.Сотрудник,
	|			ВзносыВФонды.Организация,
	|			НАЧАЛОПЕРИОДА(ВзносыВФонды.Период,МЕСЯЦ),
	|			NULL,
	|			ВзносыВФонды.СтатьяНалоговойДекларации.Код,
	|			ВзносыВФонды.СтатьяНалоговойДекларации.Наименование,
	|			НАЧАЛОПЕРИОДА(ВзносыВФонды.ПериодВзаиморасчетов, МЕСЯЦ),
	|			КОНЕЦПЕРИОДА(ВзносыВФонды.ПериодВзаиморасчетов, МЕСЯЦ)
	|		
	|	
	|		ОБЪЕДИНИТЬ ВСЕ
	|	
	|		ВЫБРАТЬ
	|			ВЫБОР 
	|				КОГДА ВзаиморасчетыСРаботниками.СчетУчета В (&ПарамДивиденды)
	|					ТОГДА ""13.ВыплатаДивидендов"" 
	|				ИНАЧЕ ""07.ВыплатаЗарплаты"" 
	|			КОНЕЦ,
	|			ВзаиморасчетыСРаботниками.Сотрудник,
	|			ВзаиморасчетыСРаботниками.Организация,
	|			НАЧАЛОПЕРИОДА(ВзаиморасчетыСРаботниками.Период, МЕСЯЦ),
	|			ВзаиморасчетыСРаботниками.Регистратор,
	|			ВзаиморасчетыСРаботниками.Период,
	|			ВзаиморасчетыСРаботниками.КодОперации,
	|			ВзаиморасчетыСРаботниками.ПериодВзаиморасчетов,
	|			КОНЕЦПЕРИОДА(ВзаиморасчетыСРаботниками.ПериодВзаиморасчетов, МЕСЯЦ),
	|			СУММА("+?(УпрУчет,"ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовУпр","ВзаиморасчетыСРаботниками.СуммаВзаиморасчетов - ВзаиморасчетыСРаботниками.СуммаОкругления")+"),
	|			NULL,
	|			NULL,
	|			NULL 
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботниками
	|		
	|		ГДЕ
	|			ВзаиморасчетыСРаботниками.Период МЕЖДУ &НачПериода И &КонПериода И
	|			ВзаиморасчетыСРаботниками.КодОперации В (&ПарамКодыОперацииВыплата)
	|			И	ВзаиморасчетыСРаботниками.Сотрудник в (&ПарамСотрудник)  
	|			И	ВзаиморасчетыСРаботниками.Организация в (&ПарамОрганизация)
	|  	
	|	СГРУППИРОВАТЬ ПО
	|			ВЫБОР 
	|				КОГДА ВзаиморасчетыСРаботниками.СчетУчета В (&ПарамДивиденды)
	|					ТОГДА ""13.ВыплатаДивидендов"" 
	|				ИНАЧЕ ""07.ВыплатаЗарплаты"" 
	|			КОНЕЦ,
	|			ВзаиморасчетыСРаботниками.Сотрудник,
	|			ВзаиморасчетыСРаботниками.Организация,
	|			НАЧАЛОПЕРИОДА(ВзаиморасчетыСРаботниками.Период, МЕСЯЦ),
	|			ВзаиморасчетыСРаботниками.Регистратор,
	|			ВзаиморасчетыСРаботниками.Период,
	|			ВзаиморасчетыСРаботниками.КодОперации,
	|			ВзаиморасчетыСРаботниками.ПериодВзаиморасчетов
	|	
	|		ОБЪЕДИНИТЬ ВСЕ
	|	
	|		ВЫБРАТЬ
	|				""14.ОстаткиДивиденды"",
	|			ВзаиморасчетыСРаботниками.Сотрудник,
	|			ВзаиморасчетыСРаботниками.Организация,
	|			ВзаиморасчетыСРаботниками.Период,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			СУММА("+?(УпрУчет,"ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовУпрНачальныйОстаток","ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовНачальныйОстаток")+"),
	|			СУММА("+?(УпрУчет,"ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовУпрКонечныйОстаток","ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовКонечныйОстаток")+"),
	|			NULL,
	|			NULL 
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(
	|			                  &НачПериода, &КонПериода, Месяц, , 
	|								Сотрудник в (&ПарамСотрудник)  
	|							И	Организация в (&ПарамОрганизация)
	|							И СчетУчета В (&ПарамДивиденды)
	|							  ) КАК ВзаиморасчетыСРаботниками
	|		
	|		СГРУППИРОВАТЬ ПО
	|				""14.ОстаткиДивиденды"",
	|			ВзаиморасчетыСРаботниками.Сотрудник,
	|			ВзаиморасчетыСРаботниками.Организация,
	|			ВзаиморасчетыСРаботниками.Период
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|	
	|		ВЫБРАТЬ
	|			""08.ОстаткиЗарплата"",
	|			ВзаиморасчетыСРаботниками.Сотрудник,
	|			ВзаиморасчетыСРаботниками.Организация,
	|			ВзаиморасчетыСРаботниками.Период,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			СУММА("+?(УпрУчет,"ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовУпрНачальныйОстаток","ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовНачальныйОстаток")+"),
	|			СУММА("+?(УпрУчет,"ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовУпрКонечныйОстаток","ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовКонечныйОстаток")+"),
	|			NULL,
	|			NULL 
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(
	|			                  &НачПериода, &КонПериода, Месяц, , 
	|								Сотрудник в (&ПарамСотрудник)  
	|							И	Организация в (&ПарамОрганизация)
	|							И СчетУчета НЕ В (&ПарамДивиденды)
	|							  ) КАК ВзаиморасчетыСРаботниками
	|		
	|		СГРУППИРОВАТЬ ПО
	|			""08.ОстаткиЗарплата"",
	|			ВзаиморасчетыСРаботниками.Сотрудник,
	|			ВзаиморасчетыСРаботниками.Организация,
	|			ВзаиморасчетыСРаботниками.Период
    |
	|			) КАК НачисленияУдержания
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних( &КонПериода) КАК ФИОФизЛиц
	|		ПО	НачисленияУдержания.Сотрудник.ФизЛицо = ФИОФизЛиц.ФизЛицо
	|
	|		// список уволенных по которым были обороты + все кто актуальны для периода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (	
	|			ВЫБРАТЬ
	|				Взаиморасчеты.Сотрудник		КАК Сотрудник,
	|				Взаиморасчеты.Организация,
	|				СУММА("+?(УпрУчет,"Взаиморасчеты.СуммаВзаиморасчетовУпрНачальныйОстаток + Взаиморасчеты.СуммаВзаиморасчетовУпрПриход + Взаиморасчеты.СуммаВзаиморасчетовУпрРасход","Взаиморасчеты.СуммаВзаиморасчетовНачальныйОстаток + Взаиморасчеты.СуммаВзаиморасчетовПриход + Взаиморасчеты.СуммаВзаиморасчетовРасход")+")
	|			
	|			ИЗ	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(
	|			                  &НачПериода, &КонПериода, Месяц, , Сотрудник в (&ПарамСотрудник)  
	|							И	Организация в (&ПарамОрганизация) ) КАК Взаиморасчеты
	|			СГРУППИРОВАТЬ ПО
	|				Взаиморасчеты.Сотрудник,
	|				Взаиморасчеты.Организация
	|
	|           ОБЪЕДИНИТЬ
	|			ВЫБРАТЬ 
	|				РаботникиОрганизаций.Организация		КАК Организация,
	|				РаботникиОрганизаций.Сотрудник			КАК Сотрудник,
	|				МАКСИМУМ(РаботникиОрганизаций.Период)	КАК Период
	|			ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций 
	|			ГДЕ		РаботникиОрганизаций.Период <= &КонПериода    
	|				И	РаботникиОрганизаций.Период >= &НачПериода
	|				ИЛИ	РаботникиОрганизаций.ЗанимаемыхСтавок = 0 И ПричинаИзмененияСостояния = &парамУвольнение
	|			СГРУППИРОВАТЬ ПО
	|				РаботникиОрганизаций.Организация,
	|				РаботникиОрганизаций.Сотрудник
	|
	|           ОБЪЕДИНИТЬ
	|			ВЫБРАТЬ 
	|				РаботникиОрганизаций.Организация		КАК Организация,
	|				РаботникиОрганизаций.Сотрудник			КАК Сотрудник,
	|				&КонПериода								КАК Период
	|			ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних( &КонПериода, Сотрудник в (&ПарамСотрудник) И	Организация в (&ПарамОрганизация) ) КАК РаботникиОрганизаций 
	|			ГДЕ		РаботникиОрганизаций.Период <= &КонПериода    
	|				И	РаботникиОрганизаций.Период >= &НачПериода
	|				ИЛИ	РаботникиОрганизаций.ЗанимаемыхСтавок = 0 И ПричинаИзмененияСостояния = &парамУвольнение
	|			
	|							  ) КАК ВзаиморасчетыСРаботниками
	|		ПО	НачисленияУдержания.Сотрудник = ВзаиморасчетыСРаботниками.Сотрудник
	|		И	НачисленияУдержания.Организация = ВзаиморасчетыСРаботниками.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИОФизЛицо,
	|	Организация,
	|	ПериодРегистрации,
	|	ВидДвижения,
	|	Порядок
	|
	|ИТОГИ ПО
	|	Сотрудник,
	|	ФИОФизЛицо,
	|	Организация,
	|	ПериодРегистрации,
	|	ВидДвижения";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапрос()

// Процедура заполняет области табличного документа, предназанченные
// для вывода удержаний
Процедура ЗаполнитьУдержания(Регистратор, ВидРасчета, НачДата, КонДата, Сумма, НомерСтроки,
	                         ВременныйТабличныйДокумент, ФорматСумм, Язык)
	
	//ВидРасчетаУдержания
	Область = ВременныйТабличныйДокумент.Область(НомерСтроки, 9);
	Область.Текст        = ВидРасчета;
	Область.Расшифровка  = Регистратор;
	
	//ПериодУдержания
	Область = ВременныйТабличныйДокумент.Область(НомерСтроки, 12);
	Область.Текст        = УправлениеОтчетами.ОписаниеПериода(НачДата,
	                       	               КонДата, Ложь, Язык);
	Область.Расшифровка  = Регистратор;
	
	//СуммаУдержания
	Область = ВременныйТабличныйДокумент.Область(НомерСтроки, 14);
	Область.Текст        = Формат(Сумма, ФорматСумм);
	Область.Расшифровка  = Регистратор;
	
КонецПроцедуры // ЗаполнитьУдержания()

// Процедура выводить область "Всего" и заполняет параметры
Процедура ВывестиОбластьВсего(ВсегоНачислено, ВсегоУдержаноВыплачено, ПараметрыВсего, 
	                          ВременныйТабличныйДокумент, ФорматСумм, ОбластьВсего)

	ПараметрыВсего.Сумма          = Формат(ВсегоНачислено, ФорматСумм);
	ПараметрыВсего.СуммаУдержания = Формат(ВсегоУдержаноВыплачено, ФорматСумм);
	ПараметрыВсего.КВыплате       = Формат(ВсегоНачислено - ВсегоУдержаноВыплачено, ФорматСумм);
	
	ВременныйТабличныйДокумент.Вывести(ОбластьВсего);
	
	ОчиститьПараметры(ПараметрыВсего);
	
	ВсегоНачислено = 0;
	ВсегоУдержаноВыплачено = 0;

КонецПроцедуры // ВывестиОбластьВсего()

// Процедура очищает структуру,
// переданную в качестве параметра 
Процедура ОчиститьПараметры(Параметры)

    Для Н = 0 По Параметры.Количество() - 1 Цикл
	
		Параметры[Н] = Неопределено;
	
	КонецЦикла;
	
КонецПроцедуры // ОчиститьПараметры()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь, ОчищатьТабличныйДокумент = Истина) Экспорт
	
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	// 37490 >>

	Если НЕ ЗначениеЗаполнено(ДатаНач) Тогда
	
		Сообщить(НСтр("ru='Не указана дата начала периода!';uk='Не зазначена дата початку періоду!'", КодЯзыкаПечать), СтатусСообщения.Важное);
		Возврат
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаКон) Тогда
		
		Сообщить(НСтр("ru='Не указана дата окончания периода!';uk='Не зазначена дата закінчення періоду!'", КодЯзыкаПечать), СтатусСообщения.Важное);
		Возврат
		
	КонецЕсли;
	
	ДатаНач = НачалоМесяца(ДатаНач);
	ДатаКон = КонецМесяца(ДатаКон);
	
	// Не всегда будем очищать Табличный документ, например, когда РЛ будут печататься из формы Т54а, то очистка не нужна
	Если ОчищатьТабличныйДокумент Тогда
		
		ДокументРезультат.Очистить();
		
	КонецЕсли; 
	
	Макет 			  		          = ПолучитьМакет("Макет");
	// 37490 <<
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	
	// печать производится на языке ИБ

	ОбластьШапка 	  		          = Макет.ПолучитьОбласть("Шапка");             
	ОбластьДопИнформация	          = Макет.ПолучитьОбласть("ДопИнформация");               
	ОбластьЗаголовокТЧЗарплата        = Макет.ПолучитьОбласть("Заголовок");
	ОбластьНачисленоУдержаноЗарплата  = Макет.ПолучитьОбласть("НачисленоУдержано");
	ОбластьЗаголовокТЧДивиденды       = Макет.ПолучитьОбласть("ЗаголовокДивиденды");
	ОбластьНачисленоУдержаноДивиденды = Макет.ПолучитьОбласть("НачисленоУдержаноДивиденды");
	ОбластьВсего                      = Макет.ПолучитьОбласть("Всего");
	ОбластьШапкаВыплата               = Макет.ПолучитьОбласть("ШапкаВыплата");
	ОбластьВыплата                    = Макет.ПолучитьОбласть("Выплата");
	ОбластьВсегоВыплата               = Макет.ПолучитьОбласть("ВсегоВыплата");
	ОбластьДолг                       = Макет.ПолучитьОбласть("Долг");
	ОбластьПодвал			          = Макет.ПолучитьОбласть("Подвал");
	
	ПараметрыШапка                      = ОбластьШапка.Параметры;
	ПараметрыДопИнформация              = ОбластьДопИнформация.Параметры;
	ПараметрыНачисленоУдержаноЗарплата  = ОбластьНачисленоУдержаноЗарплата.Параметры;
	ПараметрыНачисленоУдержаноДивиденды = ОбластьНачисленоУдержаноДивиденды.Параметры;
	ПараметрыВсего                      = ОбластьВсего.Параметры;
	ПараметрыШапкаВыплата               = ОбластьШапкаВыплата.Параметры;
	ПараметрыВыплата                    = ОбластьВыплата.Параметры;
	ПараметрыВсегоВыплата               = ОбластьВсегоВыплата.Параметры;
	ПараметрыДолг                       = ОбластьДолг.Параметры;
	
	РезультатЗапроса = СформироватьЗапрос();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Сообщить(НСтр("ru='Данные для формирования расчетных листков не обнаружены!';uk='Дані для формування розрахункових листків не знайдені!'", КодЯзыкаПечать));
	    Возврат;
		
	КонецЕсли;
	
	// В этот табличный документ будет собираться данные для РЛ
	// до проверки на возвможность его вывода (по количеству строк)
	ВременныйТабличныйДокумент = Новый ТабличныйДокумент;
	ФорматСумм      = "ЧЦ=15; ЧДЦ=2";
	ФорматПериода   = "ДФ = 'MMMM yyyy';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать);
	
	Язык            = "Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать)+";";
	
	
	
	ВыборкаСотр = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСотр.Следующий() Цикл
		ВыборкаФизЛицо = ВыборкаСотр.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
	Пока ВыборкаФизЛицо.Следующий() Цикл
		
		ПараметрыШапка.ФИОФизЛицо = ВыборкаФизЛицо.ФИОФизЛицо;
		ВыборкаОрганизация        = ВыборкаФизЛицо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОрганизация.Следующий() Цикл
			
			ПараметрыШапка.Организация = СокрП(ВыборкаОрганизация.ОрганизацияНаименованиеПолное);
			ВыборкаПериоды             = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			//ОтбрасыватьКопейки = РегистрыСведений.ПараметрыРасчетаЗарплатыОрганизаций.Получить(Новый Структура ("Организация", ВыборкаОрганизация.Организация)).ОтбрасыватьКопейки;
			ОтбрасыватьКопейки = Ложь;
			
			Пока ВыборкаПериоды.Следующий() Цикл
				
				
				КоличествоСтрокНачислений         = 0;
				ВыводилсяЗаголовокЗарплата        = Ложь;
				ВыводилсяЗаголовокДивиденды       = Ложь;
				НеВыводиласьОбластьДолг           = Истина;
				ВсегоНачислено                    = 0;
				ВсегоУдержаноВыплачено            = 0;
				
				//ПараметрыШапка.Заголовок  = НСтр("ru='Расчетный листок за ';uk='Розрахунковий листок за '",КодЯзыкаПечать)
				//						   + Формат(ВыборкаПериоды.ПериодРегистрации, ФорматПериода)+НСтр("ru=' г.';uk=' р.'",КодЯзыкаПечать);
				ПараметрыШапка.Заголовок  = НСтр("ru='Расчетный листок за ';uk='Розрахунковий листок за '", КодЯзыкаПечать)  + "
										   |" + ПредставлениеПериода(НачалоМесяца(ВыборкаПериоды.ПериодРегистрации), КонецМесяца(ВыборкаПериоды.ПериодРегистрации), "Л = "+Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать)+"; ФП = Истина");
				ВременныйТабличныйДокумент.Вывести(ОбластьШапка);
				ВыборкаВидДвижения        = ВыборкаПериоды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаВидДвижения.Следующий() Цикл
				
					ВидДвижения = ВыборкаВидДвижения.ВидДвижения;
					Выборка     = ВыборкаВидДвижения.Выбрать();
					НачисленияЗарплата  = Ложь;
					УдержанияЗарплата   = Ложь;
					ПогашениеЗаймов     = Ложь;
					НачисленияДивиденды = Ложь;
					УдержанияДивиденды  = Ложь;
					
					Если Найти("01.ОсновныеНачисления,
							   |02.ДополнительныеНачисления", ВидДвижения) > 0 Тогда
							   
						НачисленияЗарплата = Истина
						
					ИначеЕсли Найти("03.Удержания,
						            |04.НДФЛ,
						            |05.ВзносыВФонды", ВидДвижения) > 0 Тогда
							  
						УдержанияЗарплата = Истина
						
					ИначеЕсли Найти("06.ПогашениеЗаймов", ВидДвижения) > 0 Тогда
							  
						ПогашениеЗаймов = Истина
						
					ИначеЕсли Найти("09.ОсновныеНачисленияДивидендов,
						            |10.ДополнительныеНачисленияДивидендов
						            |", ВидДвижения) > 0 Тогда
									
						НачисленияДивиденды	= Истина
						
					ИначеЕсли Найти("11.УдержанияДивидендов,
						            |12.НДФЛДивидендов
						            |", ВидДвижения) > 0 Тогда
									
						УдержанияДивиденды = Истина
						
					КонецЕсли;
					
					//Проверка предыдущего вывода
					Если ВыводилсяЗаголовокЗарплата Тогда
						
						Если НЕ (НачисленияЗарплата ИЛИ УдержанияЗарплата ИЛИ ПогашениеЗаймов) Тогда
							//Необходимо вывести секцию Всего
							
							ВывестиОбластьВсего(ВсегоНачислено, ВсегоУдержаноВыплачено, ПараметрыВсего,
							                    ВременныйТабличныйДокумент, ФорматСумм, ОбластьВсего);
							ВыводилсяЗаголовокЗарплата = Ложь;
							КоличествоСтрокНачислений   = 0;

						КонецЕсли;
						
					Иначе
						
						Если НачисленияЗарплата ИЛИ УдержанияЗарплата ИЛИ ПогашениеЗаймов Тогда
							//Необходимо вывести ЗаголовокЗарплата
							
							ВременныйТабличныйДокумент.Вывести(ОбластьЗаголовокТЧЗарплата);
							ВыводилсяЗаголовокЗарплата = Истина;
							ПараметрыНачисленоУдержано = ПараметрыНачисленоУдержаноЗарплата;
							ОбластьНачисленоУдержано   = ОбластьНачисленоУдержаноЗарплата
							
						КонецЕсли;
						
						//Проверка предыдущего вывода
						//по дивидендам
						Если ВыводилсяЗаголовокДивиденды Тогда
							
							Если НЕ (НачисленияДивиденды ИЛИ УдержанияДивиденды) Тогда
								//Необходимо вывести секцию Всего
								
								ВывестиОбластьВсего(ВсегоНачислено, ВсегоУдержаноВыплачено, ПараметрыВсего,
								ВременныйТабличныйДокумент, ФорматСумм, ОбластьВсего);
								ВыводилсяЗаголовокДивиденды = Ложь;
								
							КонецЕсли;
							
						Иначе
							
							Если НачисленияДивиденды ИЛИ НачисленияДивиденды Тогда
								//Необходимо вывести ЗаголовокДивиденды
								
								ВременныйТабличныйДокумент.Вывести(ОбластьЗаголовокТЧДивиденды);
								ВыводилсяЗаголовокДивиденды = Истина;
								ПараметрыНачисленоУдержано = ПараметрыНачисленоУдержаноДивиденды;
								ОбластьНачисленоУдержано   = ОбластьНачисленоУдержаноДивиденды
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если ВидДвижения = "00.ДанныеШапки" Тогда
						
						Пока Выборка.Следующий() Цикл
						
							ПараметрыДопИнформация.Подразделение    = НСтр("ru='Подразделение: ';uk='Підрозділ: '",КодЯзыкаПечать) + Выборка.Поле4;
							ПараметрыДопИнформация.Должность        = НСтр("ru='Должность: ';uk='Посада: '",КодЯзыкаПечать) + Выборка.Поле5;
							ПараметрыДопИнформация.ТабельныйНомер   = НСтр("ru='Табельный номер: ';uk='Табельний номер: '",КодЯзыкаПечать) + Выборка.Поле1;
							ПараметрыДопИнформация.КодПоДРФО   = НСтр("ru='Код по ДРФО: ';uk='Код по ДРФО: '",КодЯзыкаПечать) + Выборка.КодПоДРФО; 
							ПараметрыДопИнформация.ОкладТариф       = НСтр("ru='Оклад/Тариф: ';uk='Оклад/Тариф: '",КодЯзыкаПечать) 
							                                          + Формат(Выборка.Поле6, ФорматСумм)
							                                          + " " + Выборка.Поле3;
																	
							ПараметрыДопИнформация.Регистратор      = Выборка.Регистратор;
							ПараметрыДопИнформация.РегистраторТариф = Выборка.Поле2;
							ВременныйТабличныйДокумент.Вывести(ОбластьДопИнформация);
																	
						
						КонецЦикла;
						
					ИначеЕсли НачисленияЗарплата ИЛИ НачисленияДивиденды Тогда
						
						Пока Выборка.Следующий() Цикл
						
							ПараметрыНачисленоУдержано.ВидРасчета  = Выборка.Поле1;
							ПараметрыНачисленоУдержано.Период      = УправлениеОтчетами.ОписаниеПериода(Выборка.Поле2,	Выборка.Поле3, Истина, Язык);
							Если НачисленияЗарплата Тогда
								
								Если Выборка.Поле5 = Окр(Выборка.Поле5) Тогда 
									ПараметрыНачисленоУдержано.Дни         = Формат(Выборка.Поле5, "ЧЦ=3");
								Иначе
									ПараметрыНачисленоУдержано.Дни         = Формат(Выборка.Поле5, "ЧЦ=7; ЧДЦ=2");
								КонецЕсли;
								Если Выборка.Поле6 = Окр(Выборка.Поле6) Тогда 
									ПараметрыНачисленоУдержано.Часы        = Формат(Выборка.Поле6, "ЧЦ=4");
								Иначе
									ПараметрыНачисленоУдержано.Часы        = Формат(Выборка.Поле6, "ЧЦ=7; ЧДЦ=2");
								КонецЕсли;	
								
								
							КонецЕсли;																		
							ПараметрыНачисленоУдержано.Сумма       = Формат(Выборка.Поле4, ФорматСумм);
							ПараметрыНачисленоУдержано.Регистратор = Выборка.Регистратор;
							
							ВсегоНачислено = ВсегоНачислено + ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.Поле4);
							
							ВременныйТабличныйДокумент.Вывести(ОбластьНачисленоУдержано);
							КоличествоСтрокНачислений = КоличествоСтрокНачислений + 1;
						
						КонецЦикла;
						
						ОчиститьПараметры(ПараметрыНачисленоУдержано);
						
					ИначеЕсли УдержанияЗарплата ИЛИ УдержанияДивиденды Тогда
						
						ВысотаТаблицы = ВременныйТабличныйДокумент.ВысотаТаблицы;
						НомерСтроки   = ВысотаТаблицы;
						
						Пока Выборка.Следующий() Цикл
							
							Если КоличествоСтрокНачислений = 0 Тогда
								//Нужен вывод новых областей
								
								ВременныйТабличныйДокумент.Вывести(ОбластьНачисленоУдержано);
								НомерСтроки = НомерСтроки + 1;
								
							Иначе
								//Заполнение уже выведенных областей
								
								//Одна строка будет обработана
								КоличествоСтрокНачислений = КоличествоСтрокНачислений - 1;
								НомерСтроки               = ВысотаТаблицы - КоличествоСтрокНачислений;
								
							КонецЕсли;
							
							ЗаполнитьУдержания(Выборка.Регистратор, Выборка.Поле1, Выборка.Поле2,
							                   Выборка.Поле3, Выборка.Поле4, НомерСтроки,
	                                           ВременныйТабличныйДокумент, ФорматСумм, Язык);
							
							ВсегоУдержаноВыплачено = ВсегоУдержаноВыплачено + ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.Поле4);
						
						КонецЦикла;
						
					ИначеЕсли ПогашениеЗаймов Тогда
						
						ВысотаТаблицы = ВременныйТабличныйДокумент.ВысотаТаблицы;
						НомерСтроки   = ВысотаТаблицы;
						
						Пока Выборка.Следующий() Цикл
							
							Для Н = 4 По 5 Цикл
								
								СуммаПогашения = Выборка["Поле" + Н];
								
								Если НЕ ЗначениеЗаполнено(СуммаПогашения) Тогда
									
									Продолжить;
									
								КонецЕсли;
							
								ВидРасчета = ?(Н = 4, НСтр("ru='Погашения займа';uk='Погашення позики'",КодЯзыкаПечать), НСтр("ru='Проценты по займу';uk='Відсотки по позиці'",КодЯзыкаПечать));
								                       
								Если КоличествоСтрокНачислений = 0 Тогда
									//Нужен вывод новых областей
									
									ВременныйТабличныйДокумент.Вывести(ОбластьНачисленоУдержано);
									НомерСтроки = НомерСтроки + 1;
									
								Иначе
									//Заполнение уже выведенных областей
									
									//Одна строка будет обработана
									КоличествоСтрокНачислений = КоличествоСтрокНачислений - 1;
									НомерСтроки               = ВысотаТаблицы - КоличествоСтрокНачислений;
									
								КонецЕсли;
								
								ЗаполнитьУдержания(Выборка.Регистратор, ВидРасчета, Выборка.Поле2,
												   , СуммаПогашения, НомерСтроки,
												   ВременныйТабличныйДокумент, ФорматСумм, Язык);
								
								ВсегоУдержаноВыплачено = ВсегоУдержаноВыплачено + ОбщегоНазначения.ПреобразоватьВЧисло(СуммаПогашения);
								
							КонецЦикла;
						
						КонецЦикла;
						
					ИначеЕсли Найти("07.ВыплатаЗарплаты, 13.ВыплатаДивидендов", ВидДвижения) > 0 Тогда
						
						Если ВидДвижения = "07.ВыплатаЗарплаты" Тогда
							ПараметрыШапкаВыплата.Выплата = НСтр("ru='Выплаты';uk='Виплати'",КодЯзыкаПечать);
						Иначе
							
							Если НеВыводиласьОбластьДолг Тогда
								//необходимо показать, что долгов по зарплате нет
								
								ПараметрыДолг.НачалоМесяца = НСтр("ru='Долг за предприятием на начало месяца: ';uk='Борг за підприємством на початок місяця: '",КодЯзыкаПечать);
								ПараметрыДолг.КонецМесяца  = НСтр("ru='Долг за предприятием на конец месяца: ';uk='Борг за підприємством на кінець місяця: '",КодЯзыкаПечать);
								ВременныйТабличныйДокумент.Вывести(ОбластьДолг);
								НеВыводиласьОбластьДолг = Ложь;
								
							КонецЕсли;
							
							ПараметрыШапкаВыплата.Выплата = НСтр("ru='Выплаты дивидендов';uk='Виплати дивідендів'",КодЯзыкаПечать);
							
						КонецЕсли;
						
						ВременныйТабличныйДокумент.Вывести(ОбластьШапкаВыплата);
						
						Пока Выборка.Следующий() Цикл
						
							ПараметрыВыплата.ВидВыплаты  = Выборка.Поле1;
							ПараметрыВыплата.ДатаВыплаты = Формат(Выборка.Порядок, "ДЛФ=D");
							ПараметрыВыплата.ЗаПериод    = УправлениеОтчетами.ОписаниеПериода(Выборка.Поле2,	Выборка.Поле3, Ложь, Язык);
							Сумма = ОбщегоНазначения.ПреобразоватьВЧисло(Выборка.Поле4);
							Если ОтбрасыватьКопейки Тогда
								Сумма = Цел(Сумма);
							КонецЕсли;	
							ПараметрыВыплата.Сумма       = Формат(Сумма, ФорматСумм);
							ПараметрыВыплата.Регистратор = Выборка.Регистратор;
							
							ВсегоУдержаноВыплачено = ВсегоУдержаноВыплачено + Сумма;
							
							ВременныйТабличныйДокумент.Вывести(ОбластьВыплата);
						
						КонецЦикла;
						
						ПараметрыВсегоВыплата.Сумма = ВсегоУдержаноВыплачено;
						ВременныйТабличныйДокумент.Вывести(ОбластьВсегоВыплата);
						ВсегоУдержаноВыплачено      = 0;
						
					ИначеЕсли Найти("08.ОстаткиЗарплата, 14.ОстаткиДивиденды", ВидДвижения) > 0 Тогда
						
						Пока Выборка.Следующий() Цикл
							
							Если Найти("08.ОстаткиЗарплата", ВидДвижения) > 0 Тогда
								
								ПараметрыДолг.НачалоМесяца = НСтр("ru='Долг предприятия на начало месяца: ';uk='Борг підприємства на початок місяця: '",КодЯзыкаПечать);
								ПараметрыДолг.КонецМесяца  = НСтр("ru='Долг предприятия на конец месяца: ';uk='Борг за підприємством на кінець місяця: '",КодЯзыкаПечать);
								
							Иначе
								
								Если НеВыводиласьОбластьДолг Тогда
									//необходимо показать, что долгов по зарплате нет
									
									ПараметрыДолг.НачалоМесяца = НСтр("ru='Долг предприятия на начало месяца: ';uk='Борг підприємства на початок місяця: '",КодЯзыкаПечать);
									ПараметрыДолг.КонецМесяца  = НСтр("ru='Долг предприятия на конец месяца: ';uk='Борг за підприємством на кінець місяця: '",КодЯзыкаПечать);
									ВременныйТабличныйДокумент.Вывести(ОбластьДолг);
									
								КонецЕсли;
								
								ПараметрыДолг.НачалоМесяца = НСтр("ru='Долг по дивидендам на начало месяца:';uk='Борг по дивідендах на початок місяця:'",КодЯзыкаПечать);
								ПараметрыДолг.КонецМесяца  = НСтр("ru='Долг по дивидендам на конец месяца:';uk='Борг по дивідендах на кінець місяця:'",КодЯзыкаПечать);
								
							КонецЕсли;
						
							ПараметрыДолг.СуммаНачМесяца = Формат(Выборка.Поле4, ФорматСумм);
							ПараметрыДолг.СуммаКонМесяца = Формат(Выборка.Поле5, ФорматСумм);
							ВременныйТабличныйДокумент.Вывести(ОбластьДолг);
							НеВыводиласьОбластьДолг = Ложь;
							
							//Очистка Параметров
							ОчиститьПараметры(ПараметрыДолг);
						
						КонецЦикла;
						
					КонецЕсли;
				
				КонецЦикла;
				
				//Проверка предыдущего вывода
				Если ВыводилсяЗаголовокЗарплата Тогда
					//Необходимо вывести секцию Всего
					
					ВывестиОбластьВсего(ВсегоНачислено, ВсегоУдержаноВыплачено, ПараметрыВсего,
					ВременныйТабличныйДокумент, ФорматСумм, ОбластьВсего);
					ВыводилсяЗаголовокЗарплата = Ложь;
					
				Иначе
					
					//Проверка предыдущего вывода
					//по дивидендам
					Если ВыводилсяЗаголовокДивиденды Тогда
						//Необходимо вывести секцию Всего
						
						ВывестиОбластьВсего(ВсегоНачислено, ВсегоУдержаноВыплачено, ПараметрыВсего,
						ВременныйТабличныйДокумент, ФорматСумм, ОбластьВсего);
						ВыводилсяЗаголовокДивиденды = Ложь;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если НеВыводиласьОбластьДолг Тогда
					//необходимо показать, что долгов по зарплате нет
										
					ПараметрыДолг.НачалоМесяца = НСтр("ru='Долг за предприятием на начало месяца: ';uk='Борг за підприємством на початок місяця: '",КодЯзыкаПечать);
					ПараметрыДолг.КонецМесяца  = НСтр("ru='Долг за предприятием на конец месяца: ';uk='Борг за підприємством на кінець місяця: '",КодЯзыкаПечать);
					ВременныйТабличныйДокумент.Вывести(ОбластьДолг);
					
				КонецЕсли;
				
				ВременныйТабличныйДокумент.Вывести(ОбластьПодвал);
				
				Если НЕ ДокументРезультат.ПроверитьВывод(ВременныйТабличныйДокумент) Тогда
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЕсли; 
				
				ДокументРезультат.Вывести(ВременныйТабличныйДокумент);
				ВременныйТабличныйДокумент.Очистить();
				
			КонецЦикла;
		
		КонецЦикла;
	
	КонецЦикла;
	КонецЦикла;

	
	ДокументРезультат.ОбластьПечати  = ДокументРезультат.Область( , 2, , 15);
	ДокументРезультат.ТолькоПросмотр = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
